In [5]:
import pandas as pd 

data = {
    'id' : [1,2,3],
    'name' : ['choi', 'jung', 'lee'],
    'age' : [23, 26,28],
    'assets' : [150.4, 123.4, 88.88],
    'job' : ['student', 'CEO', 'Dad']
}

In [6]:
df = pd.DataFrame(data)
df

   id  name  age  assets      job
0   1  choi   23  150.40  student
1   2  jung   26  123.40      CEO
2   3   lee   28   88.88      Dad

In [7]:
# columns 값을 지정하여 넘기면 원하는 순서대로 테이블 생성
# index 값을 지정하여 넘기면 index 값을 원한느 값으로 채움

df = pd.DataFrame(data, columns = ['id', 'name', 'job', 'age', 'assets', 'hobby'], 
                 index = ['one', 'two', 'three'])
df

       id  name      job  age  assets hobby
one     1  choi  student   23  150.40   NaN
two     2  jung      CEO   26  123.40   NaN
three   3   lee      Dad   28   88.88   NaN

In [8]:
# 색인 기능을 활용해서 데이터를 한번에 삽입하기

df['hobby'] = 'reading books'
df

       id  name      job  age  assets          hobby
one     1  choi  student   23  150.40  reading books
two     2  jung      CEO   26  123.40  reading books
three   3   lee      Dad   28   88.88  reading books

In [11]:
# 색인 기능을 활용하여 배열을 전달할때 데이터를 한꺼번에 삽입 가능

import numpy as np

df['age'] = np.arange(3)
df

       id  name      job  age  assets          hobby
one     1  choi  student    0  150.40  reading books
two     2  jung      CEO    1  123.40  reading books
three   3   lee      Dad    2   88.88  reading books